# Question 1

In [11]:
"""Consider the following Python module:
    
a = 0

def b():
    global a
    a = c(a)
def c(a):
    return a + 2

After importing the module into the interpreter, you execute:
>>> b()
>>> b()
>>> b()
>>> a
?
What value is displayed when the last expression (a) 
is evaluated? Explain your answer by indicating what happens in every executed statement.
"""

a = 0

def b():
    global a
    a = c(a)
def c(a):
    return a + 2

b()       # b() sets a as a global variable, so the value will remain on a global scope
          # b() function calls c() and takes 'a' as a parameter. a + 2 = 2
    
b()       #now global a equals 2, and we execute b() again, so global a = 2 + 2 = 4

b()       #now our global a equals 4 as a result of the second b() execution
          #b() calls c() and global a = 4 + 2 = 6
     
a         #global a = 6

print(a)
print('explanation on the comments next to each b() execution')

6
explanation on the comments next to each b() execution

# Question 2

In [21]:
def file_length2(file_name):
    
    try:                          #add try before the block code to handle errors
        file = open(file_name)
        contents = file.read()
        file.close()
        print(len(contents))
        
    except FileNotFoundError:    #add exception for FileNotFoundError, so it the input is not valid, the program won't crash
        
        print('I am sorry, file "{}" is not found. This is an exception'.format(file_name))

In [22]:
file_length2('problemSet2.txt')  #real file to text the function. Result  123
file_length2('midterm.py')       #input to call the exception

123
I am sorry, file "midterm.py" is not found. This is an exception

# Question 3

In [50]:
class Marsupial :
    
    def __init__(self, pouch = []):
        
        self.pouch = pouch              #create an empty list to store items on pouch
             
    def put_in_pouch(self,str):    
        
        self.pouch.append(str)          #method to add items to the pouch using append()
        
    def pouch_contents(self):
        
        print(self.pouch)               #method to show the pouch's contents
    
    
class Kangaroo(Marsupial) :
    
    def __init__(self, xcoord=0, ycoord=0):   #init method to store coordinates
        self.x = xcoord
        self.y = ycoord 
        
        Marsupial.__init__(self)             #inherit the __init__() from the superclass Marsupial to retrieve the pouch
        
        self.pouch = []                      #Empty the list. If not, it will bring up the previous elements from Marsupial
        
    def setx(self, xcoord):                   #set x coordinate if needed
        self.x = xcoord
        
    def sety(self, ycoord):                   #set y coordinate if needed
        self.y = ycoord

    def jump (self, xcoord, ycoord) :        #alter the coordinates according to new parameters
        self.x += xcoord
        self.y += ycoord   
        
    def get(self):                            #return x and y
        return(self.x, self.y)
    
    def __str__(self):                       #method to represent class Kangaroo in a string, taking all outputs from the functions
                                             #within the class
        return 'I am a Kangaroo located at coordinates({}, {})'.format(self.x, self.y)

In [51]:
m = Marsupial()

m.put_in_pouch('doll')
m.put_in_pouch('firetruck')
m.put_in_pouch('kitten')

m.pouch_contents()

['doll', 'firetruck', 'kitten']

In [54]:
k = Kangaroo(0,0)

print(k)

k.put_in_pouch('doll') 
k.put_in_pouch('firetruck')
k.put_in_pouch('kitten')

k.pouch_contents()

k.jump(1,0)
k.jump(1,0)
k.jump(1,0)
print(k)

I am a Kangaroo located at coordinates(0, 0)
['doll', 'firetruck', 'kitten']
I am a Kangaroo located at coordinates(3, 0)

# Question 4

In [40]:
def collatz(x) :

    if x > 1 :                     #if the number is greater than 1, enter to the recursion
        if x%2 == 0:               #if the number is even, then print it, and call collatz again but x divided by 2
            print(x)               #the function will go over and over until x is no longer greater than 1, and prints x
            collatz(x/2)
        else :
            collatz((x*3+1))       #if the number is odd (not even), calls collatz again with x multiplied by 3 + 1
    else :
        print(x)

In [41]:
collatz(1)

1

In [42]:
collatz(10)

10
16.0
8.0
4.0
2.0
1.0

# Question 5

In [103]:
    def binary(x) :

        if x == 0:                      #this covers a potential input of 0
            return x 
                                        #example binary(3)
        elif x >= 1:                    #3 is greater than 1 so binary (3//2) = 1 gets activated
            binary(x // 2)              #binary(1) is equal than 1 so binary(1//2) = 0 gets activated
            print (x % 2,end='')        #binary(0) is smaller than 1, so the recursion goes back to binary(1)
                                        #binary(1) prints 1 modulus 2 = 1 and goes back to binary(3)
                                        #binary(3) prints 3 modulus 2 = 1 and finished the recursion.

In [104]:
binary(0)

0

In [105]:
binary(1)

1

In [106]:
binary(3)

11

In [107]:
binary(9)

1001

# Question 6 and 7
Sorry. I have gone through the material but I still need more time to understand these concepts. I will get it ready for later assignments/tests

# Question 8

In [140]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\mrmat\anaconda3\lib\site-packages (0.4.0)
Requirement already satisfied: six in c:\users\mrmat\anaconda3\lib\site-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\mrmat\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\mrmat\anaconda3\lib\site-packages (from ipython-sql) (1.4.7)
Requirement already satisfied: ipython>=1.0 in c:\users\mrmat\anaconda3\lib\site-packages (from ipython-sql) (7.22.0)
Requirement already satisfied: sqlparse in c:\users\mrmat\anaconda3\lib\site-packages (from ipython-sql) (0.4.1)
Requirement already satisfied: prettytable<1 in c:\users\mrmat\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: backcall in c:\users\mrmat\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\mrmat\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.17)
Requirement already satisfied: jedi>=0.16 in c:\users\mrmat\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.17.2)
Requirement already satisfied: decorator in c:\users\mrmat\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.0.6)
Requirement already satisfied: pickleshare in c:\users\mrmat\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in c:\users\mrmat\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.0.5)
Requirement already satisfied: colorama in c:\users\mrmat\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: setuptools>=18.5 in c:\users\mrmat\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (52.0.0.post20210125)
Requirement already satisfied: pygments in c:\users\mrmat\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.8.1)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in c:\users\mrmat\anaconda3\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in c:\users\mrmat\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\mrmat\anaconda3\lib\site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.0.0)

In [146]:
%%capture
%load_ext sql
%sql sqlite:///chinook.db
    
#retrieved from https://community.dataquest.io/t/guided-sql-project-error-cell-magic-sql-not-found/348678/2

In [ ]:
%%sql
CREATE TABLE WeatherReport3
(
    city         VARCHAR(200),     
    country      VARCHAR(200),
    season       VARCHAR(200),
    temperature  FLOAT,
    rainfall     FLOAT
)

In [ ]:
%%sql
INSERT INTO WeatherReport3 (city, country, season,temperature, rainfall)

VALUES
 ('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346),
 ('London', 'United Kingdom', 'Winter', 4.2, 207.7),
 ('London', 'United Kingdom', 'Spring', 8.3, 169.6),
 ('London', 'United Kingdom', 'Summer', 15.7, 157),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Winter', 13.6, 16.5),
 ('Cairo', 'Egypt', 'Spring', 20.7, 6.5),
 ('Cairo', 'Egypt', 'Summer', 27.7, 0.1),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)

In [185]:
%%sql
select * from WeatherReport3

 * sqlite:///chinook.db
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('London', 'United Kingdom', 'Winter', 4.2, 207.7),
 ('London', 'United Kingdom', 'Spring', 8.3, 169.6),
 ('London', 'United Kingdom', 'Summer', 15.7, 157.0),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Winter', 13.6, 16.5),
 ('Cairo', 'Egypt', 'Spring', 20.7, 6.5),
 ('Cairo', 'Egypt', 'Summer', 27.7, 0.1),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

# 8. a

In [186]:
%%sql

SELECT temperature FROM WeatherReport3

 * sqlite:///chinook.db
Done.

[(24.8,),
 (28.4,),
 (27.9,),
 (27.6,),
 (4.2,),
 (8.3,),
 (15.7,),
 (10.4,),
 (13.6,),
 (20.7,),
 (27.7,),
 (22.2,)]

# 8.b

In [187]:
%%sql
SELECT DISTINCT city FROM WeatherReport3

 * sqlite:///chinook.db
Done.

[('Mumbai',), ('London',), ('Cairo',)]

# 8.c

In [188]:
%%sql
SELECT * FROM WeatherReport3 
WHERE country = 'India';

 * sqlite:///chinook.db
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0)]

 # 8.d

In [189]:
%%sql
SELECT season FROM WeatherReport3 
WHERE season = 'Fall'

 * sqlite:///chinook.db
Done.

[('Fall',), ('Fall',), ('Fall',)]

# 8.e

In [194]:
%%sql
SELECT city, country, season FROM WeatherReport3 
WHERE rainfall>= 200 and rainfall <= 400

 * sqlite:///chinook.db
Done.

[('Mumbai', 'India', 'Fall'),
 ('London', 'United Kingdom', 'Winter'),
 ('London', 'United Kingdom', 'Fall')]

# 8.f

In [196]:
%%sql
SELECT city, country, temperature FROM WeatherReport3 
WHERE temperature >= 20 

ORDER BY temperature ASC

 * sqlite:///chinook.db
Done.

[('Cairo', 'Egypt', 20.7),
 ('Cairo', 'Egypt', 22.2),
 ('Mumbai', 'India', 24.8),
 ('Mumbai', 'India', 27.6),
 ('Cairo', 'Egypt', 27.7),
 ('Mumbai', 'India', 27.9),
 ('Mumbai', 'India', 28.4)]

# 8.g

In [198]:
%%sql
SELECT SUM(rainfall) FROM WeatherReport3 
WHERE city = 'Cairo'

 * sqlite:///chinook.db
Done.

[(27.6,)]

# 8.h

In [208]:
%%sql
SELECT season,SUM(rainfall) FROM WeatherReport3
GROUP BY season

 * sqlite:///chinook.db
Done.

[('Fall', 569.0),
 ('Spring', 192.29999999999998),
 ('Summer', 1706.5),
 ('Winter', 230.1)]

# Question 9

# 9.a

In [3]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

def uppercasing(words) :                       
            
    upperSentence = []
    
    for word in words :                        #iterate trough the list and populate and empty one with the value in uppercase
        upperSentence.append(word.upper())
    
    return upperSentence


uppercasing(words)

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']

# 9.b

In [4]:
def lowercazing(words) :
    
    lowerSentence = []
     
    for word in words :                      #iterate trough the list and populate and empty one with the value in lowercase
        lowerSentence.append(word.lower())
    
    return lowerSentence

lowercazing(words)

['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

# 9.c

In [28]:
def lengthOfWords(words) :
    
    length = []
    
    for word in words :           ##iterate trough the list and populate and empty one with the value length of each word
        length.append(len(word))
    
    return length

lengthOfWords(words)

[3, 5, 5, 3, 5, 4, 3, 4, 3]

# 9.d

In [31]:
def combinationABC(words) :
    
    combination = []
    
    for word in words:                   #iterate trough the list and populate and empty one with an temporary sublist
        
        subcombo = []
        
        subcombo.append(word.upper())     #for each word in words, the sublist will get the word in upper, lower, and len()
        subcombo.append(word.lower())
        subcombo.append(len(word))
        
        combination.append(subcombo)     #once the 3 values are added to the sublist, they will be appended as one sublist of
                                         #the main combination empty list. 
            
    print(combination,end='')            #a new temporary empty sublist gets created with each iteration until complete the cycle
   
    #print('')
    #print(subcombo,end='')

combinationABC(words)

[['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN', 'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5], ['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy', 4], ['DOG', 'dog', 3]]